emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#define RCC_ICSCR1_MSIKRANGE_MSIRC0         ((0U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_MSIRC1         ((4U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_MSIRC2         ((8U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_MSIRC3         ((12U) << 24U)

#define RCC_PLL1CFGR_PLL1SRC_NOCLOCK        ((0U) << 0U)
#define RCC_PLL1CFGR_PLL1SRC_MSIS           ((1U) << 0U)
#define RCC_PLL1CFGR_PLL1SRC_HSI16          ((2U) << 0U)
#define RCC_PLL1CFGR_PLL1SRC_HSE            ((3U) << 0U)

#define RCC_PLL2CFGR_PLL2SRC_NOCLOCK        ((0U) << 0U)
#define RCC_PLL2CFGR_PLL2SRC_MSIS           ((1U) << 0U)
#define RCC_PLL2CFGR_PLL2SRC_HSI16          ((2U) << 0U)
#define RCC_PLL2CFGR_PLL2SRC_HSE            ((3U) << 0U)

#define RCC_PLL3CFGR_PLL3SRC_NOCLOCK        ((0U) << 0U)
#define RCC_PLL3CFGR_PLL3SRC_MSIS           ((1U) << 0U)
#define RCC_PLL3CFGR_PLL3SRC_HSI16          ((2U) << 0U)
#define RCC_PLL3CFGR_PLL3SRC_HSE            ((3U) << 0U)

#define RCC_CFGR1_SW_MSIS                   ((0U) << 0U)
#define RCC_CFGR1_SW_HSI16                  ((1U) << 0U)
#define RCC_CFGR1_SW_HSE                    ((2U) << 0U)
#define RCC_CFGR1_SW_PLL1R                  ((3U) << 0U)

#define RCC_CFGR1_MCOSEL_NOCLOCK            ((0U) << 24U)
#define RCC_CFGR1_MCOSEL_SYSCLK             ((1U) << 24U)
#define RCC_CFGR1_MCOSEL_MSIS               ((2U) << 24U)
#define RCC_CFGR1_MCOSEL_HSI16              ((3U) << 24U)
#define RCC_CFGR1_MCOSEL_HSE                ((4U) << 24U)
#define RCC_CFGR1_MCOSEL_PLL1R              ((5U) << 24U)
#define RCC_CFGR1_MCOSEL_LSI                ((6U) << 24U)
#define RCC_CFGR1_MCOSEL_LSE                ((7U) << 24U)
#define RCC_CFGR1_MCOSEL_HSI48              ((8U) << 24U)
#define RCC_CFGR1_MCOSEL_MSIK               ((9U) << 24U)

#define RCC_BDCR_RTCSEL_NOCLOCK             ((0U) << 8U)
#define RCC_BDCR_RTCSEL_LSE                 ((1U) << 8U)
#define RCC_BDCR_RTCSEL_LSI                 ((2U) << 8U)
#define RCC_BDCR_RTCSEL_HSEDIV              ((3U) << 8U)

#define RCC_CCIPR1_USART1SEL_PCLK2          ((0U) << 0U)
#define RCC_CCIPR1_USART1SEL_SYSCLK         ((1U) << 0U)
#define RCC_CCIPR1_USART1SEL_HSI16          ((2U) << 0U)
#define RCC_CCIPR1_USART1SEL_LSE            ((3U) << 0U)

#define RCC_CCIPR1_USART2SEL_PCLK1          ((0U) << 2U)
#define RCC_CCIPR1_USART2SEL_SYSCLK         ((1U) << 2U)
#define RCC_CCIPR1_USART2SEL_HSI16          ((2U) << 2U)
#define RCC_CCIPR1_USART2SEL_LSE            ((3U) << 2U)

#define RCC_CCIPR1_USART3SEL_PCLK1          ((0U) << 4U)
#define RCC_CCIPR1_USART3SEL_SYSCLK         ((1U) << 4U)
#define RCC_CCIPR1_USART3SEL_HSI16          ((2U) << 4U)
#define RCC_CCIPR1_USART3SEL_LSE            ((3U) << 4U)

#define RCC_CCIPR1_UART4SEL_PCLK1           ((0U) << 6U)
#define RCC_CCIPR1_UART4SEL_SYSCLK          ((1U) << 6U)
#define RCC_CCIPR1_UART4SEL_HSI16           ((2U) << 6U)
#define RCC_CCIPR1_UART4SEL_LSE             ((3U) << 6U)

#define RCC_CCIPR1_UART5SEL_PCLK1           ((0U) << 8U)
#define RCC_CCIPR1_UART5SEL_SYSCLK          ((1U) << 8U)
#define RCC_CCIPR1_UART5SEL_HSI16           ((2U) << 8U)
#define RCC_CCIPR1_UART5SEL_LSE             ((3U) << 8U)

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_USART6SEL_PCLK1        ((0U) << 16U)
  #define RCC_CCIPR2_USART6SEL_SYSCLK       ((1U) << 16U)
  #define RCC_CCIPR2_USART6SEL_HSI16        ((2U) << 16U)
  #define RCC_CCIPR2_USART6SEL_LSE          ((3U) << 16U)
#endif

#define RCC_CCIPR3_LPUART1SEL_PCLK3         ((0U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_SYSCLK        ((1U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_HSI16         ((2U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_LSE           ((3U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_MSIK          ((4U) << 0U)

#define RCC_CCIPR1_I2C1SEL_PCLK1            ((0U) << 10U)
#define RCC_CCIPR1_I2C1SEL_SYSCLK           ((1U) << 10U)
#define RCC_CCIPR1_I2C1SEL_HSI16            ((2U) << 10U)
#define RCC_CCIPR1_I2C1SEL_MSIK             ((3U) << 10U)

#define RCC_CCIPR1_I2C2SEL_PCLK1            ((0U) << 12U)
#define RCC_CCIPR1_I2C2SEL_SYSCLK           ((1U) << 12U)
#define RCC_CCIPR1_I2C2SEL_HSI16            ((2U) << 12U)
#define RCC_CCIPR1_I2C2SEL_MSIK             ((3U) << 12U)

#define RCC_CCIPR1_I2C4SEL_PCLK1            ((0U) << 14U)
#define RCC_CCIPR1_I2C4SEL_SYSCLK           ((1U) << 14U)
#define RCC_CCIPR1_I2C4SEL_HSI16            ((2U) << 14U)
#define RCC_CCIPR1_I2C4SEL_MSIK             ((3U) << 14U)

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_I2C5SEL_PCLK1          ((0U) << 24U)
  #define RCC_CCIPR2_I2C5SEL_SYSCLK         ((1U) << 24U)
  #define RCC_CCIPR2_I2C5SEL_HSI16          ((2U) << 24U)
  #define RCC_CCIPR2_I2C5SEL_MSIK           ((3U) << 24U)
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_I2C6SEL_PCLK1          ((0U) << 26U)
  #define RCC_CCIPR2_I2C6SEL_SYSCLK         ((1U) << 26U)
  #define RCC_CCIPR2_I2C6SEL_HSI16          ((2U) << 26U)
  #define RCC_CCIPR2_I2C6SEL_MSIK           ((3U) << 26U)
#endif

#define RCC_CCIPR3_I2C3SEL_PCLK3            ((0U) << 6U)
#define RCC_CCIPR3_I2C3SEL_SYSCLK           ((1U) << 6U)
#define RCC_CCIPR3_I2C3SEL_HSI16            ((2U) << 6U)
#define RCC_CCIPR3_I2C3SEL_MSIK             ((3U) << 6U)

#define RCC_CCIPR1_SPI1SEL_PCLK2            ((0U) << 20U)
#define RCC_CCIPR1_SPI1SEL_SYSCLK           ((1U) << 20U)
#define RCC_CCIPR1_SPI1SEL_HSI16            ((2U) << 20U)
#define RCC_CCIPR1_SPI1SEL_MSIK             ((3U) << 20U)

#define RCC_CCIPR1_SPI2SEL_PCLK1            ((0U) << 16U)
#define RCC_CCIPR1_SPI2SEL_SYSCLK           ((1U) << 16U)
#define RCC_CCIPR1_SPI2SEL_HSI16            ((2U) << 16U)
#define RCC_CCIPR1_SPI2SEL_MSIK             ((3U) << 16U)

#define RCC_CCIPR3_SPI3SEL_PCLK3            ((0U) << 3U)
#define RCC_CCIPR3_SPI3SEL_SYSCLK           ((1U) << 3U)
#define RCC_CCIPR3_SPI3SEL_HSI16            ((2U) << 3U)
#define RCC_CCIPR3_SPI3SEL_MSIK             ((3U) << 3U)

#define RCC_CCIPR1_FDCANSEL_HSE             ((0U) << 24U)
#define RCC_CCIPR1_FDCANSEL_PLL1Q           ((1U) << 24U)
#define RCC_CCIPR1_FDCANSEL_PLL2P           ((2U) << 24U)
#define RCC_CCIPR1_FDCANSEL_IGNORE          0xFFFFFFFFU

#define RCC_CCIPR1_SYSTICKSEL_HCLKDIV8      ((0U) << 22U)
#define RCC_CCIPR1_SYSTICKSEL_LSI           ((1U) << 22U)
#define RCC_CCIPR1_SYSTICKSEL_LSE           ((2U) << 22U)
#define RCC_CCIPR1_SYSTICKSEL_IGNORE        0xFFFFFFFFU

#define RCC_CCIPR1_ICLKSEL_HSI48            ((0U) << 26U)
#define RCC_CCIPR1_ICLKSEL_PLL2Q            ((1U) << 26U)
#define RCC_CCIPR1_ICLKSEL_PLL1Q            ((2U) << 26U)
#define RCC_CCIPR1_ICLKSEL_MSIK             ((3U) << 26U)

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_USBPHYCSEL_HSE         ((0U) << 30U)
  #define RCC_CCIPR2_USBPHYCSEL_PLL1P       ((1U) << 30U)
  #define RCC_CCIPR2_USBPHYCSEL_HSEDIV2     ((2U) << 30U)
  #define RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2   ((3U) << 30U)
#endif

#define RCC_CCIPR2_SDMMCSEL_ICLK            ((0U) << 14U)
#define RCC_CCIPR2_SDMMCSEL_PLL1P           ((1U) << 14U)

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_DSIHOSTSEL_PLL3P       ((0U) << 15U)
  #define RCC_CCIPR2_DSIHOSTSEL_DSIPHY      ((1U) << 15U)
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_LTDCSEL_PLL3R          ((0U) << 18U)
  #define RCC_CCIPR2_LTDCSEL_PLL2R          ((1U) << 18U)
#endif

