emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#define RCC_CCIPR2_OCTOSPISEL_SYSCLK        ((0U) << 20U)
#define RCC_CCIPR2_OCTOSPISEL_MSIK          ((1U) << 20U)
#define RCC_CCIPR2_OCTOSPISEL_PLL1Q         ((2U) << 20U)
#define RCC_CCIPR2_OCTOSPISEL_PLL2Q         ((3U) << 20U)
#define RCC_CCIPR2_OCTOSPISEL_IGNORE        0xFFFFFFFFU

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_HSPISEL_SYSCLK         ((0U) << 22U)
  #define RCC_CCIPR2_HSPISEL_PLL1Q          ((1U) << 22U)
  #define RCC_CCIPR2_HSPISEL_PLL2Q          ((2U) << 22U)
  #define RCC_CCIPR2_HSPISEL_PLL3R          ((3U) << 22U)
#endif

#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CCIPR2_SAESSEL_SHSI           ((0U) << 11U)
  #define RCC_CCIPR2_SAESSEL_SHSIDIV2       ((1U) << 11U)
#endif

#define RCC_CCIPR2_RNGSEL_HSI48             ((0U) << 12U)
#define RCC_CCIPR2_RNGSEL_HSI48DIV2         ((1U) << 12U)
#define RCC_CCIPR2_RNGSEL_HSI16             ((2U) << 12U)
#define RCC_CCIPR2_RNGSEL_IGNORE            0xFFFFFFFFU

#define RCC_CCIPR2_SAI1SEL_PLL2P            ((0U) << 5U)
#define RCC_CCIPR2_SAI1SEL_PLL3P            ((1U) << 5U)
#define RCC_CCIPR2_SAI1SEL_PLL1P            ((2U) << 5U)
#define RCC_CCIPR2_SAI1SEL_AUDIOCLK         ((3U) << 5U)
#define RCC_CCIPR2_SAI1SEL_HSI16            ((4U) << 5U)
#define RCC_CCIPR2_SAI1SEL_IGNORE           0xFFFFFFFFU

#define RCC_CCIPR2_SAI2SEL_PLL2P            ((0U) << 8U)
#define RCC_CCIPR2_SAI2SEL_PLL3P            ((1U) << 8U)
#define RCC_CCIPR2_SAI2SEL_PLL1P            ((2U) << 8U)
#define RCC_CCIPR2_SAI2SEL_AUDIOCLK         ((3U) << 8U)
#define RCC_CCIPR2_SAI2SEL_HSI16            ((4U) << 8U)
#define RCC_CCIPR2_SAI2SEL_IGNORE           0xFFFFFFFFU

#define RCC_CCIPR2_MDF1SEL_HCLK             ((0U) << 0U)
#define RCC_CCIPR2_MDF1SEL_PLL1P            ((1U) << 0U)
#define RCC_CCIPR2_MDF1SEL_PLL3Q            ((2U) << 0U)
#define RCC_CCIPR2_MDF1SEL_AUDIOCLK         ((3U) << 0U)
#define RCC_CCIPR2_MDF1SEL_MSIK             ((4U) << 0U)
#define RCC_CCIPR2_MDF1SEL_IGNORE           0xFFFFFFFFU

#define RCC_CCIPR3_ADF1SEL_HCLK             ((0U) << 16U)
#define RCC_CCIPR3_ADF1SEL_PLL1P            ((1U) << 16U)
#define RCC_CCIPR3_ADF1SEL_PLL3Q            ((2U) << 16U)
#define RCC_CCIPR3_ADF1SEL_AUDIOCLK         ((3U) << 16U)
#define RCC_CCIPR3_ADF1SEL_MSIK             ((4U) << 16U)
#define RCC_CCIPR3_ADF1SEL_IGNORE           0xFFFFFFFFU

#define RCC_CCIPR3_ADCDACSEL_HCLK           ((0U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_SYSCLK         ((1U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_PLL2R          ((2U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_HSE            ((3U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_HSI16          ((4U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_MSIK           ((5U) << 12U)
#define RCC_CCIPR3_ADCDACSEL_IGNORE         0xFFFFFFFFU

#define RCC_CCIPR3_DAC1SEL_LSE              ((0U) << 15U)
#define RCC_CCIPR3_DAC1SEL_LSI              ((1U) << 15U)
#define RCC_CCIPR3_DAC1SEL_IGNORE           0xFFFFFFFFU

#define RCC_CCIPR3_LPTIM1SEL_MSIK           ((0U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_LSI            ((1U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_HSI16          ((2U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_LSE            ((3U) << 10U)

#define RCC_CCIPR1_LPTIM2SEL_PCLK1          ((0U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSI            ((1U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_HSI16          ((2U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSE            ((3U) << 18U)

#define RCC_CCIPR3_LPTIM34SEL_MSIK          ((0U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSI           ((1U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_HSI16         ((2U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSE           ((3U) << 8U)
/** @} */

/**
 * @name    Generated scaler selector constants
 * @{
 */
#define RCC_ICSCR1_MSISRANGE_DIV1           ((0U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV2           ((1U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV3           ((2U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV4           ((3U) << 28U)

#define RCC_ICSCR1_MSIKRANGE_DIV1           ((0U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV2           ((1U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV3           ((2U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV4           ((3U) << 24U)

#define RCC_CFGR2_HPRE_DIV1                 ((0U) << 0U)
#define RCC_CFGR2_HPRE_DIV2                 ((8U) << 0U)
#define RCC_CFGR2_HPRE_DIV4                 ((9U) << 0U)
#define RCC_CFGR2_HPRE_DIV8                 ((10U) << 0U)
#define RCC_CFGR2_HPRE_DIV16                ((11U) << 0U)
#define RCC_CFGR2_HPRE_DIV64                ((12U) << 0U)
#define RCC_CFGR2_HPRE_DIV128               ((13U) << 0U)
#define RCC_CFGR2_HPRE_DIV256               ((14U) << 0U)
#define RCC_CFGR2_HPRE_DIV512               ((15U) << 0U)

#define RCC_CFGR2_PPRE1_DIV1                ((0U) << 4U)
#define RCC_CFGR2_PPRE1_DIV2                ((4U) << 4U)
#define RCC_CFGR2_PPRE1_DIV4                ((5U) << 4U)
#define RCC_CFGR2_PPRE1_DIV8                ((6U) << 4U)
#define RCC_CFGR2_PPRE1_DIV16               ((7U) << 4U)

#define RCC_CFGR2_PPRE2_DIV1                ((0U) << 8U)
#define RCC_CFGR2_PPRE2_DIV2                ((4U) << 8U)
#define RCC_CFGR2_PPRE2_DIV4                ((5U) << 8U)
#define RCC_CFGR2_PPRE2_DIV8                ((6U) << 8U)
#define RCC_CFGR2_PPRE2_DIV16               ((7U) << 8U)

#define RCC_CFGR3_PPRE3_DIV1                ((0U) << 4U)
#define RCC_CFGR3_PPRE3_DIV2                ((4U) << 4U)
#define RCC_CFGR3_PPRE3_DIV4                ((5U) << 4U)
#define RCC_CFGR3_PPRE3_DIV8                ((6U) << 4U)
#define RCC_CFGR3_PPRE3_DIV16               ((7U) << 4U)

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define RCC_CFGR2_PPRE_DPHY_DIV1          ((0U) << 12U)
  #define RCC_CFGR2_PPRE_DPHY_DIV2          ((4U) << 12U)
  #define RCC_CFGR2_PPRE_DPHY_DIV4          ((5U) << 12U)
  #define RCC_CFGR2_PPRE_DPHY_DIV8          ((6U) << 12U)
  #define RCC_CFGR2_PPRE_DPHY_DIV16         ((7U) << 12U)
#endif

#define RCC_CFGR1_MCOPRE_DIV1               ((0U) << 28U)
#define RCC_CFGR1_MCOPRE_DIV2               ((1U) << 28U)
#define RCC_CFGR1_MCOPRE_DIV4               ((2U) << 28U)
#define RCC_CFGR1_MCOPRE_DIV8               ((3U) << 28U)
#define RCC_CFGR1_MCOPRE_DIV16              ((4U) << 28U)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Clock tree configurations
 * @{
 */
/**
 * @brief   Enables dynamic clock handling.
 */
#if !defined(STM32_CFG_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
  #define STM32_CFG_CLOCK_DYNAMIC           FALSE
#endif

/**
 * @brief   Selects the core voltage scaling range.
 */
#if !defined(STM32_CFG_PWR_VOSR) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_VOSR                PWR_VOSR_VOS_RANGE1
#endif

/**
 * @brief   Selects the LSI oscillator output divider.
 */
#if !defined(STM32_CFG_LSI_PREDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_PREDIV              RCC_BDCR_LSIPREDIV_DIV1
#endif

/**
 * @brief   Selects the external audio clock frequency.
 */
#if !defined(STM32_CFG_AUDIOCLK) || defined(__DOXYGEN__)
  #define STM32_CFG_AUDIOCLK                0U
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the DSI PHY PLL output frequency.
 */
  #if !defined(STM32_CFG_DSIPHYCLK) || defined(__DOXYGEN__)
    #define STM32_CFG_DSIPHYCLK             0U
  #endif
#endif

/**
 * @brief   Selects the MSIS frequency range.
 */
#if !defined(STM32_CFG_MSIS_RANGE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIS_RANGE              RCC_ICSCR1_MSISRANGE_RANGE0_48M
#endif

/**
 * @brief   Selects the MSIK frequency range.
 */
#if !defined(STM32_CFG_MSIK_RANGE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIK_RANGE              RCC_ICSCR1_MSIKRANGE_RANGE0_48M
#endif

/**
 * @brief   Selects the MSI bias mode.
 */
#if !defined(STM32_CFG_MSIBIAS) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIBIAS                 RCC_ICSCR1_MSIBIAS_CONTINUOUS
#endif

/**
 * @brief   Selects the timer internal capture clock sources.
 */
#if !defined(STM32_CFG_TIMICSEL) || defined(__DOXYGEN__)
  #define STM32_CFG_TIMICSEL                RCC_CCIPR1_TIMICSEL_NOCLOCK
#endif

/**
 * @brief   Selects the system clock source after Stop mode.
 */
#if !defined(STM32_CFG_STOPWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPWUCK                RCC_CFGR1_STOPWUCK_MSIS
#endif

/**
 * @brief   Selects the kernel clock source after Stop mode.
 */
#if !defined(STM32_CFG_STOPKERWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPKERWUCK             RCC_CFGR1_STOPKERWUCK_MSIK
#endif

/**
 * @brief   Controls external demand for the PLL1P clock.
 */
#if !defined(STM32_CFG_PLL1P_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1P_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL1Q clock.
 */
#if !defined(STM32_CFG_PLL1Q_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1Q_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL1R clock.
 */
#if !defined(STM32_CFG_PLL1R_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1R_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL2P clock.
 */
#if !defined(STM32_CFG_PLL2P_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2P_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL2Q clock.
 */
#if !defined(STM32_CFG_PLL2Q_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2Q_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL2R clock.
 */
#if !defined(STM32_CFG_PLL2R_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2R_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL3P clock.
 */
#if !defined(STM32_CFG_PLL3P_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3P_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL3Q clock.
 */
#if !defined(STM32_CFG_PLL3Q_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3Q_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the PLL3R clock.
 */
#if !defined(STM32_CFG_PLL3R_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3R_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the USART1 clock.
 */
#if !defined(STM32_CFG_USART1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the USART2 clock.
 */
#if !defined(STM32_CFG_USART2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_USART2_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the USART3 clock.
 */
#if !defined(STM32_CFG_USART3_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the UART4 clock.
 */
#if !defined(STM32_CFG_UART4_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the UART5 clock.
 */
#if !defined(STM32_CFG_UART5_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_CLOCK_MODE        STM32_CLOCK_AUTO
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the USART6 clock.
 */
  #if !defined(STM32_CFG_USART6_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_USART6_CLOCK_MODE     STM32_CLOCK_AUTO
  #endif
#endif

/**
 * @brief   Controls external demand for the LPUART1 clock.
 */
#if !defined(STM32_CFG_LPUART1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_CLOCK_MODE      STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the I2C1 clock.
 */
#if !defined(STM32_CFG_I2C1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the I2C2 clock.
 */
#if !defined(STM32_CFG_I2C2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the I2C3 clock.
 */
#if !defined(STM32_CFG_I2C3_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the I2C4 clock.
 */
#if !defined(STM32_CFG_I2C4_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C4_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the I2C5 clock.
 */
  #if !defined(STM32_CFG_I2C5_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_I2C5_CLOCK_MODE       STM32_CLOCK_AUTO
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the I2C6 clock.
 */
  #if !defined(STM32_CFG_I2C6_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_I2C6_CLOCK_MODE       STM32_CLOCK_AUTO
  #endif
#endif

/**
 * @brief   Controls external demand for the SPI1 clock.
 */
#if !defined(STM32_CFG_SPI1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SPI2 clock.
 */
#if !defined(STM32_CFG_SPI2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SPI3 clock.
 */
#if !defined(STM32_CFG_SPI3_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the FDCAN1 clock.
 */
#if !defined(STM32_CFG_FDCAN1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SYSTICK clock.
 */
#if !defined(STM32_CFG_SYSTICK_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSTICK_CLOCK_MODE      STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the USB clock.
 */
#if !defined(STM32_CFG_USB_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_USB_CLOCK_MODE          STM32_CLOCK_AUTO
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the OTGHS clock.
 */
  #if !defined(STM32_CFG_OTGHS_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_OTGHS_CLOCK_MODE      STM32_CLOCK_AUTO
  #endif
#endif

/**
 * @brief   Controls external demand for the SDMMC1 clock.
 */
#if !defined(STM32_CFG_SDMMC1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SDMMC1_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SDMMC2 clock.
 */
#if !defined(STM32_CFG_SDMMC2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SDMMC2_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the OCTOSPI clock.
 */
#if !defined(STM32_CFG_OCTOSPI_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_CLOCK_MODE      STM32_CLOCK_AUTO
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the HSPI1 clock.
 */
  #if !defined(STM32_CFG_HSPI1_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_HSPI1_CLOCK_MODE      STM32_CLOCK_AUTO
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the DSI clock.
 */
  #if !defined(STM32_CFG_DSI_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_DSI_CLOCK_MODE        STM32_CLOCK_AUTO
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the LTDC clock.
 */
  #if !defined(STM32_CFG_LTDC_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_LTDC_CLOCK_MODE       STM32_CLOCK_AUTO
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Controls external demand for the SAES clock.
 */
  #if !defined(STM32_CFG_SAES_CLOCK_MODE) || defined(__DOXYGEN__)
    #define STM32_CFG_SAES_CLOCK_MODE       STM32_CLOCK_AUTO
  #endif
#endif

/**
 * @brief   Controls external demand for the RNG clock.
 */
#if !defined(STM32_CFG_RNG_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_CLOCK_MODE          STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SAI1 clock.
 */
#if !defined(STM32_CFG_SAI1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the SAI2 clock.
 */
#if !defined(STM32_CFG_SAI2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI2_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the MDF1 clock.
 */
#if !defined(STM32_CFG_MDF1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_MDF1_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the ADF1 clock.
 */
#if !defined(STM32_CFG_ADF1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the ADCDAC clock.
 */
#if !defined(STM32_CFG_ADCDAC_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDAC_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the DAC1SH clock.
 */
#if !defined(STM32_CFG_DAC1SH_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the LPTIM1 clock.
 */
#if !defined(STM32_CFG_LPTIM1_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the LPTIM2 clock.
 */
#if !defined(STM32_CFG_LPTIM2_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_CLOCK_MODE       STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the LPTIM34 clock.
 */
#if !defined(STM32_CFG_LPTIM34_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_CLOCK_MODE      STM32_CLOCK_AUTO
#endif

/**
 * @brief   Controls external demand for the IWDG clock.
 */
#if !defined(STM32_CFG_IWDG_CLOCK_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_IWDG_CLOCK_MODE         STM32_CLOCK_AUTO
#endif

/**
 * @brief   Enables the HSI16 clock source.
 */
#if !defined(STM32_CFG_HSI16_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI16_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSI48 clock source.
 */
#if !defined(STM32_CFG_HSI48_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI48_ENABLE            TRUE
#endif

/**
 * @brief   Enables the SHSI clock source.
 */
#if !defined(STM32_CFG_SHSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_SHSI_ENABLE             FALSE
#endif

/**
 * @brief   Enables the HSE clock source.
 */
#if !defined(STM32_CFG_HSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSE clock source.
 */
#if !defined(STM32_CFG_LSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSI clock source.
 */
#if !defined(STM32_CFG_LSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_ENABLE              FALSE
#endif

/**
 * @brief   Selects the PLL1IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL1IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1IN_SEL              RCC_PLL1CFGR_PLL1SRC_MSIS
#endif

/**
 * @brief   Configures the PLL1REF clock divider value.
 */
#if !defined(STM32_CFG_PLL1REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1REF_VALUE           3
#endif

/**
 * @brief   Configures the PLL1VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL1VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1VCO_VALUE           10
#endif

/**
 * @brief   Configures the PLL1P clock divider value.
 */
#if !defined(STM32_CFG_PLL1P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1P_VALUE             1
#endif

/**
 * @brief   Configures the PLL1Q clock divider value.
 */
#if !defined(STM32_CFG_PLL1Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1Q_VALUE             1
#endif

/**
 * @brief   Configures the PLL1R clock divider value.
 */
#if !defined(STM32_CFG_PLL1R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1R_VALUE             1
#endif

/**
 * @brief   Selects the PLL2IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL2IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2IN_SEL              RCC_PLL2CFGR_PLL2SRC_MSIS
#endif

/**
 * @brief   Configures the PLL2REF clock divider value.
 */
#if !defined(STM32_CFG_PLL2REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2REF_VALUE           1
#endif

/**
 * @brief   Configures the PLL2VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL2VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2VCO_VALUE           32
#endif

/**
 * @brief   Configures the PLL2P clock divider value.
 */
#if !defined(STM32_CFG_PLL2P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2P_VALUE             4
#endif

