emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/**
 * @brief   Configures the PLL2Q clock divider value.
 */
#if !defined(STM32_CFG_PLL2Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2Q_VALUE             4
#endif

/**
 * @brief   Configures the PLL2R clock divider value.
 */
#if !defined(STM32_CFG_PLL2R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2R_VALUE             4
#endif

/**
 * @brief   Selects the PLL3IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL3IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3IN_SEL              RCC_PLL3CFGR_PLL3SRC_MSIS
#endif

/**
 * @brief   Configures the PLL3REF clock divider value.
 */
#if !defined(STM32_CFG_PLL3REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3REF_VALUE           1
#endif

/**
 * @brief   Configures the PLL3VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL3VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3VCO_VALUE           32
#endif

/**
 * @brief   Configures the PLL3P clock divider value.
 */
#if !defined(STM32_CFG_PLL3P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3P_VALUE             4
#endif

/**
 * @brief   Configures the PLL3Q clock divider value.
 */
#if !defined(STM32_CFG_PLL3Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3Q_VALUE             4
#endif

/**
 * @brief   Configures the PLL3R clock divider value.
 */
#if !defined(STM32_CFG_PLL3R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3R_VALUE             4
#endif

/**
 * @brief   Selects the SYSCLK clock source.
 * @note    Allowed sources:
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - PLL1R.
 */
#if !defined(STM32_CFG_SYSCLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSCLK_SEL              RCC_CFGR1_SW_PLL1R
#endif

/**
 * @brief   Configures the HCLK clock divider value.
 */
#if !defined(STM32_CFG_HCLK_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_HCLK_VALUE              1
#endif

/**
 * @brief   Configures the PCLK1 clock divider value.
 */
#if !defined(STM32_CFG_PCLK1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK1_VALUE             1
#endif

/**
 * @brief   Configures the PCLK2 clock divider value.
 */
#if !defined(STM32_CFG_PCLK2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK2_VALUE             1
#endif

/**
 * @brief   Configures the PCLK3 clock divider value.
 */
#if !defined(STM32_CFG_PCLK3_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK3_VALUE             1
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Configures the DPHY clock divider value.
 */
  #if !defined(STM32_CFG_DPHY_VALUE) || defined(__DOXYGEN__)
    #define STM32_CFG_DPHY_VALUE            8
  #endif
#endif

/**
 * @brief   Selects the MCODIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - PLL1R.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_MCODIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCODIV_SEL              RCC_CFGR1_MCOSEL_NOCLOCK
#endif

/**
 * @brief   Configures the MCO clock divider value.
 */
#if !defined(STM32_CFG_MCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO_VALUE               1
#endif

/**
 * @brief   Selects the RTC clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSE.
 *          - LSI.
 *          - HSEDIV.
 */
#if !defined(STM32_CFG_RTC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RTC_SEL                 RCC_BDCR_RTCSEL_NOCLOCK
#endif

/**
 * @brief   Selects the LSCO clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSI.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LSCO_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LSCO_SEL                RCC_BDCR_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   Selects the USART1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_SEL              RCC_CCIPR1_USART1SEL_PCLK2
#endif

/**
 * @brief   Selects the USART2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART2_SEL              RCC_CCIPR1_USART2SEL_PCLK1
#endif

/**
 * @brief   Selects the USART3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_SEL              RCC_CCIPR1_USART3SEL_PCLK1
#endif

/**
 * @brief   Selects the UART4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_UART4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_SEL               RCC_CCIPR1_UART4SEL_PCLK1
#endif

/**
 * @brief   Selects the UART5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_UART5_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_SEL               RCC_CCIPR1_UART5SEL_PCLK1
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the USART6 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
  #if !defined(STM32_CFG_USART6_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_USART6_SEL            RCC_CCIPR2_USART6SEL_PCLK1
  #endif
#endif

/**
 * @brief   Selects the LPUART1 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 *          - MSIK.
 */
#if !defined(STM32_CFG_LPUART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_SEL             RCC_CCIPR3_LPUART1SEL_PCLK3
#endif

/**
 * @brief   Selects the I2C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_SEL                RCC_CCIPR1_I2C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_SEL                RCC_CCIPR1_I2C2SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C4_SEL                RCC_CCIPR1_I2C4SEL_PCLK1
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the I2C5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
  #if !defined(STM32_CFG_I2C5_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_I2C5_SEL              RCC_CCIPR2_I2C5SEL_PCLK1
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the I2C6 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
  #if !defined(STM32_CFG_I2C6_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_I2C6_SEL              RCC_CCIPR2_I2C6SEL_PCLK1
  #endif
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR3_I2C3SEL_PCLK3
#endif

/**
 * @brief   Selects the SPI1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_SEL                RCC_CCIPR1_SPI1SEL_PCLK2
#endif

/**
 * @brief   Selects the SPI2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_SEL                RCC_CCIPR1_SPI2SEL_PCLK1
#endif

/**
 * @brief   Selects the SPI3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_SEL                RCC_CCIPR3_SPI3SEL_PCLK3
#endif

/**
 * @brief   Selects the FDCAN1 clock source.
 * @note    Allowed sources:
 *          - HSE.
 *          - PLL1Q.
 *          - PLL2P.
 *          - inactive selection RCC_CCIPR1_FDCANSEL_IGNORE.
 */
#if !defined(STM32_CFG_FDCAN1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_SEL              RCC_CCIPR1_FDCANSEL_HSE
#endif

/**
 * @brief   Selects the SYSTICK clock source.
 * @note    Allowed sources:
 *          - HCLKDIV8.
 *          - LSI.
 *          - LSESYS.
 *          - inactive selection RCC_CCIPR1_SYSTICKSEL_IGNORE.
 */
#if !defined(STM32_CFG_SYSTICK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSTICK_SEL             RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
#endif

/**
 * @brief   Selects the ICLK clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - PLL2Q.
 *          - PLL1Q.
 *          - MSIK.
 */
#if !defined(STM32_CFG_ICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ICLK_SEL                RCC_CCIPR1_ICLKSEL_HSI48
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the USBPHYC clock source.
 * @note    Allowed sources:
 *          - HSE.
 *          - PLL1P.
 *          - HSEDIV2.
 *          - PLL1PDIV2.
 */
  #if !defined(STM32_CFG_USBPHYC_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_USBPHYC_SEL           RCC_CCIPR2_USBPHYCSEL_HSE
  #endif
#endif

/**
 * @brief   Selects the SDMMC clock source.
 * @note    Allowed sources:
 *          - ICLK.
 *          - PLL1P.
 */
#if !defined(STM32_CFG_SDMMC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SDMMC_SEL               RCC_CCIPR2_SDMMCSEL_PLL1P
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the DSI clock source.
 * @note    Allowed sources:
 *          - PLL3P.
 *          - DSIPHY.
 */
  #if !defined(STM32_CFG_DSI_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_DSI_SEL               RCC_CCIPR2_DSIHOSTSEL_PLL3P
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the LTDC clock source.
 * @note    Allowed sources:
 *          - PLL3R.
 *          - PLL2R.
 */
  #if !defined(STM32_CFG_LTDC_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_LTDC_SEL              RCC_CCIPR2_LTDCSEL_PLL3R
  #endif
#endif

/**
 * @brief   Selects the OCTOSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 *          - PLL1Q.
 *          - PLL2Q.
 *          - inactive selection RCC_CCIPR2_OCTOSPISEL_IGNORE.
 */
#if !defined(STM32_CFG_OCTOSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_SEL             RCC_CCIPR2_OCTOSPISEL_SYSCLK
#endif

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the HSPI1 clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - PLL1Q.
 *          - PLL2Q.
 *          - PLL3R.
 */
  #if !defined(STM32_CFG_HSPI1_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_HSPI1_SEL             RCC_CCIPR2_HSPISEL_SYSCLK
  #endif
#endif

#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   Selects the SAES clock source.
 * @note    Allowed sources:
 *          - SHSI.
 *          - SHSIDIV2.
 */
  #if !defined(STM32_CFG_SAES_SEL) || defined(__DOXYGEN__)
    #define STM32_CFG_SAES_SEL              RCC_CCIPR2_SAESSEL_SHSI
  #endif
#endif

/**
 * @brief   Selects the RNG clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - HSI48DIV2.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_RNGSEL_IGNORE.
 */
#if !defined(STM32_CFG_RNG_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_SEL                 RCC_CCIPR2_RNGSEL_HSI48
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI1SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR2_SAI1SEL_PLL2P
#endif

/**
 * @brief   Selects the SAI2 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI2SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI2_SEL                RCC_CCIPR2_SAI2SEL_PLL2P
#endif

/**
 * @brief   Selects the MDF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR2_MDF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_MDF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MDF1_SEL                RCC_CCIPR2_MDF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_ADF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_SEL                RCC_CCIPR3_ADF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADCDAC clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - SYSCLK.
 *          - PLL2R.
 *          - HSE.
 *          - HSI16.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADCDACSEL_IGNORE.
 */
#if !defined(STM32_CFG_ADCDAC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDAC_SEL              RCC_CCIPR3_ADCDACSEL_HCLK
#endif

/**
 * @brief   Selects the DAC1SH clock source.
 * @note    Allowed sources:
 *          - LSESYS.
 *          - LSI.
 *          - inactive selection RCC_CCIPR3_DAC1SEL_IGNORE.
 */
#if !defined(STM32_CFG_DAC1SH_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_SEL              RCC_CCIPR3_DAC1SEL_LSE
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR3_LPTIM1SEL_MSIK
#endif

/**
 * @brief   Selects the LPTIM2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_SEL              RCC_CCIPR1_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM34 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM34_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_SEL             RCC_CCIPR3_LPTIM34SEL_MSIK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !defined(PWR_VOSR_VOS_RANGE1) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE1 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE2) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE2 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE3) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE3 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE4) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE4 not defined"
#endif
#if !((STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE1) ||                        \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE2) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE3) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE4)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

