emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3Q_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3R_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART4_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART5_CLOCK_MODE value specified"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_USART6_CLOCK_MODE == STM32_CLOCK_DISABLED) ||            \
       (STM32_CFG_USART6_CLOCK_MODE == STM32_CLOCK_AUTO) ||                 \
       (STM32_CFG_USART6_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&             \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_USART6_CLOCK_MODE value specified"
  #endif
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPUART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C4_CLOCK_MODE value specified"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_I2C5_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
       (STM32_CFG_I2C5_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
       (STM32_CFG_I2C5_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_I2C5_CLOCK_MODE value specified"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_I2C6_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
       (STM32_CFG_I2C6_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
       (STM32_CFG_I2C6_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_I2C6_CLOCK_MODE value specified"
  #endif
#endif

#if !((STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI3_CLOCK_MODE value specified"
#endif

