emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_FDCAN1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SYSTICK_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USB_CLOCK_MODE value specified"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_OTGHS_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
       (STM32_CFG_OTGHS_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
       (STM32_CFG_OTGHS_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_OTGHS_CLOCK_MODE value specified"
  #endif
#endif

#if !((STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SDMMC1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SDMMC2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_OCTOSPI_CLOCK_MODE value specified"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_HSPI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
       (STM32_CFG_HSPI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
       (STM32_CFG_HSPI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_HSPI1_CLOCK_MODE value specified"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_DSI_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
       (STM32_CFG_DSI_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
       (STM32_CFG_DSI_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_DSI_CLOCK_MODE value specified"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_LTDC_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
       (STM32_CFG_LTDC_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
       (STM32_CFG_LTDC_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_LTDC_CLOCK_MODE value specified"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_SAES_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
       (STM32_CFG_SAES_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
       (STM32_CFG_SAES_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
      !defined(__DOXYGEN__)
    #error "invalid STM32_CFG_SAES_CLOCK_MODE value specified"
  #endif
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_RNG_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MDF1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADF1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADCDAC_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_DAC1SH_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM34_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_IWDG_CLOCK_MODE value specified"
#endif

