emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !(((STM32_CFG_USBPHYC_SEL != RCC_CCIPR2_USBPHYCSEL_PLL1P) &&          \
        (STM32_CFG_USBPHYC_SEL != RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2)) ||      \
       (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_HSE)) &&               \
      !defined(__DOXYGEN__)
    #error "PLL1 must use HSE when selected as OTG_HS PHY reference"
  #endif
#endif

#if !((STM32_CFG_PLL1P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1P clock disabled but PLL1P clock is required"
#endif

#if !((STM32_CFG_PLL1Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1Q clock disabled but PLL1Q clock is required"
#endif

#if !((STM32_CFG_PLL1R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1R clock disabled but PLL1R clock is required"
#endif

#if !((STM32_CFG_PLL2P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2P clock disabled but PLL2P clock is required"
#endif

#if !((STM32_CFG_PLL2Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2Q clock disabled but PLL2Q clock is required"
#endif

#if !((STM32_CFG_PLL2R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2R clock disabled but PLL2R clock is required"
#endif

#if !((STM32_CFG_PLL3P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3P clock disabled but PLL3P clock is required"
#endif

#if !((STM32_CFG_PLL3Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3Q clock disabled but PLL3Q clock is required"
#endif

#if !((STM32_CFG_PLL3R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3R clock disabled but PLL3R clock is required"
#endif

#if !((STM32_CFG_USART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART1 clock disabled but USART1 clock is required"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART2 clock disabled but USART2 clock is required"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART3 clock disabled but USART3 clock is required"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART4 clock disabled but UART4 clock is required"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART5_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART5 clock disabled but UART5 clock is required"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_USART6_CLOCK_MODE != STM32_CLOCK_DISABLED) ||            \
       !defined(STM32_USART6_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "USART6 clock disabled but USART6 clock is required"
  #endif
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_LPUART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPUART1 clock disabled but LPUART1 clock is required"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C1 clock disabled but I2C1 clock is required"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C2 clock disabled but I2C2 clock is required"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C3 clock disabled but I2C3 clock is required"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C4 clock disabled but I2C4 clock is required"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_I2C5_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
       !defined(STM32_I2C5_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "I2C5 clock disabled but I2C5 clock is required"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_I2C6_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
       !defined(STM32_I2C6_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "I2C6 clock disabled but I2C6 clock is required"
  #endif
#endif

#if !((STM32_CFG_SPI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI1 clock disabled but SPI1 clock is required"
#endif

#if !((STM32_CFG_SPI2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI2 clock disabled but SPI2 clock is required"
#endif

#if !((STM32_CFG_SPI3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI3 clock disabled but SPI3 clock is required"
#endif

#if !((STM32_CFG_FDCAN1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_FDCAN1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "FDCAN1 clock disabled but FDCAN1 clock is required"
#endif

