emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_SYSTICK_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_SYSTICK_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SYSTICK clock disabled but SYSTICK clock is required"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_USB_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USB clock disabled but USB clock is required"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_OTGHS_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
       !defined(STM32_OTGHS_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "OTGHS clock disabled but OTGHS clock is required"
  #endif
#endif

#if !((STM32_CFG_SDMMC1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_SDMMC1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SDMMC1 clock disabled but SDMMC1 clock is required"
#endif

#if !((STM32_CFG_SDMMC2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_SDMMC2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SDMMC2 clock disabled but SDMMC2 clock is required"
#endif

#if !((STM32_CFG_OCTOSPI_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_OCTOSPI_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "OCTOSPI clock disabled but OCTOSPI clock is required"
#endif

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_HSPI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
       !defined(STM32_HSPI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "HSPI1 clock disabled but HSPI1 clock is required"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_DSI_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
       !defined(STM32_DSI_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "DSI clock disabled but DSI clock is required"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_LTDC_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
       !defined(STM32_LTDC_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "LTDC clock disabled but LTDC clock is required"
  #endif
#endif

#if (STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)
  #if !((STM32_CFG_SAES_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
       !defined(STM32_SAES_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
    #error "SAES clock disabled but SAES clock is required"
  #endif
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_RNG_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "RNG clock disabled but RNG clock is required"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SAI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SAI1 clock disabled but SAI1 clock is required"
#endif

#if !((STM32_CFG_SAI2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SAI2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SAI2 clock disabled but SAI2 clock is required"
#endif

#if !((STM32_CFG_MDF1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_MDF1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "MDF1 clock disabled but MDF1 clock is required"
#endif

#if !((STM32_CFG_ADF1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_ADF1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "ADF1 clock disabled but ADF1 clock is required"
#endif

#if !((STM32_CFG_ADCDAC_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_ADCDAC_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "ADCDAC clock disabled but ADCDAC clock is required"
#endif

#if !((STM32_CFG_DAC1SH_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_DAC1SH_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "DAC1SH clock disabled but DAC1SH clock is required"
#endif

#if !((STM32_CFG_LPTIM1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_LPTIM1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPTIM1 clock disabled but LPTIM1 clock is required"
#endif

#if !((STM32_CFG_LPTIM2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_LPTIM2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPTIM2 clock disabled but LPTIM2 clock is required"
#endif

#if !((STM32_CFG_LPTIM34_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_LPTIM34_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPTIM34 clock disabled but LPTIM34 clock is required"
#endif

#if !((STM32_CFG_IWDG_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_IWDG_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "IWDG clock disabled but IWDG clock is required"
#endif

/*
 * Derived configuration macros.
 */
#define STM32_DCFG_MSISRC_SEL               (STM32_CFG_MSIS_RANGE &         \
                                             (12U << RCC_ICSCR1_MSISRANGE_Pos))

#define STM32_DCFG_MSISDIV_VALUE            ((((STM32_CFG_MSIS_RANGE >> RCC_ICSCR1_MSISRANGE_Pos) & \
                                               3U) + 1U))

#define STM32_DCFG_MSIKRC_SEL               (STM32_CFG_MSIK_RANGE &         \
                                             (12U << RCC_ICSCR1_MSIKRANGE_Pos))

