emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/*
 * Selected frequency limits.
 */
#if (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE1) || \
    defined(__DOXYGEN__)
#define STM32_HSECLK_MIN                    STM32_VOS1_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS1_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS1_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS1_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS1_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS1_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS1_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS1_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS1_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS1_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS1_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS1_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS1_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS1_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS1_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS1_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS1_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS1_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS1_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS1_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS1_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS1_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS1_SDMMCCLK_MAX
#define STM32_HSPICLK_MAX                   STM32_VOS1_HSPICLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS1_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS1_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS1_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS1_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS1_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS1_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS1_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS1_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS1_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS1_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS1_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS1_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS1_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS1_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS1_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS1_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE2)
#define STM32_HSECLK_MIN                    STM32_VOS2_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS2_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS2_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS2_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS2_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS2_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS2_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS2_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS2_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS2_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS2_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS2_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS2_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS2_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS2_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS2_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS2_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS2_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS2_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS2_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS2_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS2_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS2_SDMMCCLK_MAX
#define STM32_HSPICLK_MAX                   STM32_VOS2_HSPICLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS2_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS2_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS2_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS2_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS2_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS2_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS2_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS2_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS2_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS2_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS2_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS2_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS2_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS2_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS2_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS2_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE3)
#define STM32_HSECLK_MIN                    STM32_VOS3_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS3_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS3_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS3_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS3_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS3_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS3_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS3_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS3_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS3_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS3_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS3_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS3_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS3_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS3_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS3_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS3_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS3_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS3_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS3_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS3_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS3_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS3_SDMMCCLK_MAX
#define STM32_HSPICLK_MAX                   STM32_VOS3_HSPICLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS3_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS3_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS3_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS3_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS3_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS3_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS3_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS3_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS3_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS3_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS3_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS3_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS3_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS3_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS3_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS3_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE4)
#define STM32_HSECLK_MIN                    STM32_VOS4_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS4_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS4_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS4_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS4_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS4_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS4_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS4_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS4_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS4_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS4_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS4_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS4_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS4_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS4_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS4_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS4_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS4_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS4_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS4_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS4_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS4_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS4_SDMMCCLK_MAX
#define STM32_HSPICLK_MAX                   STM32_VOS4_HSPICLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS4_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS4_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS4_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS4_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS4_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS4_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS4_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS4_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS4_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS4_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS4_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS4_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS4_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS4_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS4_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS4_FLASH_15WS_MAX
#else
  #error "unable to select clock frequency limits"
#endif

/**
 * @name    Sink demand states
 * @{
 */
/**
 * @brief   PLL1P sink demand state.
 */
#if ((STM32_CFG_PLL1P_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL1P_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL1P_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL1P_DEMANDED              TRUE
#else
  #define STM32_PLL1P_DEMANDED              FALSE
#endif

/**
 * @brief   PLL1Q sink demand state.
 */
#if ((STM32_CFG_PLL1Q_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL1Q_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL1Q_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL1Q_DEMANDED              TRUE
#else
  #define STM32_PLL1Q_DEMANDED              FALSE
#endif

/**
 * @brief   PLL1R sink demand state.
 */
#if ((STM32_CFG_PLL1R_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL1R_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL1R_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL1R_DEMANDED              TRUE
#else
  #define STM32_PLL1R_DEMANDED              FALSE
#endif

/**
 * @brief   PLL2P sink demand state.
 */
#if ((STM32_CFG_PLL2P_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL2P_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL2P_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL2P_DEMANDED              TRUE
#else
  #define STM32_PLL2P_DEMANDED              FALSE
#endif

/**
 * @brief   PLL2Q sink demand state.
 */
#if ((STM32_CFG_PLL2Q_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL2Q_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL2Q_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL2Q_DEMANDED              TRUE
#else
  #define STM32_PLL2Q_DEMANDED              FALSE
#endif

/**
 * @brief   PLL2R sink demand state.
 */
#if ((STM32_CFG_PLL2R_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL2R_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL2R_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL2R_DEMANDED              TRUE
#else
  #define STM32_PLL2R_DEMANDED              FALSE
#endif

/**
 * @brief   PLL3P sink demand state.
 */
#if ((STM32_CFG_PLL3P_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL3P_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL3P_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL3P_DEMANDED              TRUE
#else
  #define STM32_PLL3P_DEMANDED              FALSE
#endif

/**
 * @brief   PLL3Q sink demand state.
 */
#if ((STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL3Q_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL3Q_DEMANDED              TRUE
#else
  #define STM32_PLL3Q_DEMANDED              FALSE
#endif

/**
 * @brief   PLL3R sink demand state.
 */
#if ((STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_PLL3R_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_PLL3R_DEMANDED              TRUE
#else
  #define STM32_PLL3R_DEMANDED              FALSE
#endif

/**
 * @brief   USART1 sink demand state.
 */
#if ((STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_USART1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_USART1_DEMANDED             TRUE
#else
  #define STM32_USART1_DEMANDED             FALSE
#endif

/**
 * @brief   USART2 sink demand state.
 */
#if ((STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_USART2_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_USART2_DEMANDED             TRUE
#else
  #define STM32_USART2_DEMANDED             FALSE
#endif

/**
 * @brief   USART3 sink demand state.
 */
#if ((STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_USART3_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_USART3_DEMANDED             TRUE
#else
  #define STM32_USART3_DEMANDED             FALSE
#endif

/**
 * @brief   UART4 sink demand state.
 */
#if ((STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_UART4_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_UART4_DEMANDED              TRUE
#else
  #define STM32_UART4_DEMANDED              FALSE
#endif

/**
 * @brief   UART5 sink demand state.
 */
#if ((STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
     ((STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
      defined(STM32_UART5_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_UART5_DEMANDED              TRUE
#else
  #define STM32_UART5_DEMANDED              FALSE
#endif

/**
 * @brief   USART6 sink demand state.
 */
#if (((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) &&                            \
     ((STM32_CFG_USART6_CLOCK_MODE == STM32_CLOCK_ENABLED) ||               \
      ((STM32_CFG_USART6_CLOCK_MODE == STM32_CLOCK_AUTO) &&                 \
       defined(STM32_USART6_CLOCK_REQUIRED)))) || defined(__DOXYGEN__)
  #define STM32_USART6_DEMANDED             TRUE
#else
  #define STM32_USART6_DEMANDED             FALSE
#endif

/**
 * @brief   LPUART1 sink demand state.
 */
#if ((STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||               \
     ((STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                 \
      defined(STM32_LPUART1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_LPUART1_DEMANDED            TRUE
#else
  #define STM32_LPUART1_DEMANDED            FALSE
#endif

/**
 * @brief   I2C1 sink demand state.
 */
#if ((STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_I2C1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_I2C1_DEMANDED               TRUE
#else
  #define STM32_I2C1_DEMANDED               FALSE
#endif

/**
 * @brief   I2C2 sink demand state.
 */
#if ((STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_I2C2_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_I2C2_DEMANDED               TRUE
#else
  #define STM32_I2C2_DEMANDED               FALSE
#endif

/**
 * @brief   I2C3 sink demand state.
 */
#if ((STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_I2C3_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_I2C3_DEMANDED               TRUE
#else
  #define STM32_I2C3_DEMANDED               FALSE
#endif

/**
 * @brief   I2C4 sink demand state.
 */
#if ((STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_I2C4_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_I2C4_DEMANDED               TRUE
#else
  #define STM32_I2C4_DEMANDED               FALSE
#endif

/**
 * @brief   I2C5 sink demand state.
 */
#if (((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) &&                            \
     ((STM32_CFG_I2C5_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
      ((STM32_CFG_I2C5_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
       defined(STM32_I2C5_CLOCK_REQUIRED)))) || defined(__DOXYGEN__)
  #define STM32_I2C5_DEMANDED               TRUE
#else
  #define STM32_I2C5_DEMANDED               FALSE
#endif

/**
 * @brief   I2C6 sink demand state.
 */
#if (((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) &&                            \
     ((STM32_CFG_I2C6_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                 \
      ((STM32_CFG_I2C6_CLOCK_MODE == STM32_CLOCK_AUTO) &&                   \
       defined(STM32_I2C6_CLOCK_REQUIRED)))) || defined(__DOXYGEN__)
  #define STM32_I2C6_DEMANDED               TRUE
#else
  #define STM32_I2C6_DEMANDED               FALSE
#endif

/**
 * @brief   SPI1 sink demand state.
 */
#if ((STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_SPI1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_SPI1_DEMANDED               TRUE
#else
  #define STM32_SPI1_DEMANDED               FALSE
#endif

/**
 * @brief   SPI2 sink demand state.
 */
#if ((STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_SPI2_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_SPI2_DEMANDED               TRUE
#else
  #define STM32_SPI2_DEMANDED               FALSE
#endif

/**
 * @brief   SPI3 sink demand state.
 */
#if ((STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_SPI3_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_SPI3_DEMANDED               TRUE
#else
  #define STM32_SPI3_DEMANDED               FALSE
#endif

/**
 * @brief   FDCAN1 sink demand state.
 */
#if ((STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_FDCAN1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_FDCAN1_DEMANDED             TRUE
#else
  #define STM32_FDCAN1_DEMANDED             FALSE
#endif

/**
 * @brief   SYSTICK sink demand state.
 */
#if ((STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_ENABLED) ||               \
     ((STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_AUTO) &&                 \
      defined(STM32_SYSTICK_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_SYSTICK_DEMANDED            TRUE
#else
  #define STM32_SYSTICK_DEMANDED            FALSE
#endif

/**
 * @brief   TIMICSEL_HSI16_SOURCE sink demand state.
 */
#define STM32_TIMICSEL_HSI16_SOURCE_DEMANDED (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK)

/**
 * @brief   TIMICSEL_MSIS_SOURCE sink demand state.
 */
#define STM32_TIMICSEL_MSIS_SOURCE_DEMANDED (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK)

/**
 * @brief   TIMICSEL_MSIK_SOURCE sink demand state.
 */
#define STM32_TIMICSEL_MSIK_SOURCE_DEMANDED (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK)

/**
 * @brief   USB sink demand state.
 */
#if ((STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                   \
     ((STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_AUTO) &&                     \
      defined(STM32_USB_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_USB_DEMANDED                TRUE
#else
  #define STM32_USB_DEMANDED                FALSE
#endif

/**
 * @brief   OTGHS sink demand state.
 */
#if (((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                             \
      (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) &&                            \
     ((STM32_CFG_OTGHS_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
      ((STM32_CFG_OTGHS_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
       defined(STM32_OTGHS_CLOCK_REQUIRED)))) || defined(__DOXYGEN__)
  #define STM32_OTGHS_DEMANDED              TRUE
#else
  #define STM32_OTGHS_DEMANDED              FALSE
#endif

