emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/**
 * @brief   PCLK1 clock derived enable state.
 */
#define STM32_PCLK1_ENABLED                 TRUE

/**
 * @brief   PCLK1TIM clock derived enable state.
 */
#define STM32_PCLK1TIM_ENABLED              TRUE

/**
 * @brief   PCLK2 clock derived enable state.
 */
#define STM32_PCLK2_ENABLED                 TRUE

/**
 * @brief   PCLK2TIM clock derived enable state.
 */
#define STM32_PCLK2TIM_ENABLED              TRUE

/**
 * @brief   PCLK3 clock derived enable state.
 */
#define STM32_PCLK3_ENABLED                 TRUE

/**
 * @brief   DPHY clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_DPHY_ENABLED                TRUE
#else
  #define STM32_DPHY_ENABLED                FALSE
#endif

/**
 * @brief   HSEDIV clock derived enable state.
 */
#define STM32_HSEDIV_ENABLED                (((STM32_RTC_ENABLED == TRUE) && \
                                              (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)))

/**
 * @brief   MCODIV clock derived enable state.
 */
#define STM32_MCODIV_ENABLED                TRUE

/**
 * @brief   MCO clock derived enable state.
 */
#define STM32_MCO_ENABLED                   TRUE

/**
 * @brief   LSESYS clock derived enable state.
 */
#define STM32_LSESYS_ENABLED                (((STM32_LSCO_ENABLED == TRUE) && \
                                              (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)) || \
                                             ((STM32_USART1_ENABLED == TRUE) && \
                                              (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_LSE)) || \
                                             ((STM32_USART2_ENABLED == TRUE) && \
                                              (STM32_CFG_USART2_SEL == RCC_CCIPR1_USART2SEL_LSE)) || \
                                             ((STM32_USART3_ENABLED == TRUE) && \
                                              (STM32_CFG_USART3_SEL == RCC_CCIPR1_USART3SEL_LSE)) || \
                                             ((STM32_UART4_ENABLED == TRUE) && \
                                              (STM32_CFG_UART4_SEL == RCC_CCIPR1_UART4SEL_LSE)) || \
                                             ((STM32_UART5_ENABLED == TRUE) && \
                                              (STM32_CFG_UART5_SEL == RCC_CCIPR1_UART5SEL_LSE)) || \
                                             ((STM32_USART6_ENABLED == TRUE) && \
                                              (STM32_CFG_USART6_SEL == RCC_CCIPR2_USART6SEL_LSE)) || \
                                             ((STM32_LPUART1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_LSE)) || \
                                             ((STM32_SYSTICK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)) || \
                                             ((STM32_DAC1SH_ENABLED == TRUE) && \
                                              (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSE)) || \
                                             ((STM32_LPTIM1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSE)) || \
                                             ((STM32_LPTIM2_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSE)) || \
                                             ((STM32_LPTIM34_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSE)))

/**
 * @brief   RTC clock derived enable state.
 */
#define STM32_RTC_ENABLED                   TRUE

/**
 * @brief   LSCO clock derived enable state.
 */
#define STM32_LSCO_ENABLED                  TRUE

/**
 * @brief   USART1 clock derived enable state.
 */
#define STM32_USART1_ENABLED                ((STM32_USART1_DEMANDED == TRUE))

/**
 * @brief   USART2 clock derived enable state.
 */
#define STM32_USART2_ENABLED                ((STM32_USART2_DEMANDED == TRUE))

/**
 * @brief   USART3 clock derived enable state.
 */
#define STM32_USART3_ENABLED                ((STM32_USART3_DEMANDED == TRUE))

/**
 * @brief   UART4 clock derived enable state.
 */
#define STM32_UART4_ENABLED                 ((STM32_UART4_DEMANDED == TRUE))

/**
 * @brief   UART5 clock derived enable state.
 */
#define STM32_UART5_ENABLED                 ((STM32_UART5_DEMANDED == TRUE))

/**
 * @brief   USART6 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_USART6_ENABLED              ((STM32_USART6_DEMANDED == TRUE))
#else
  #define STM32_USART6_ENABLED              FALSE
#endif

/**
 * @brief   LPUART1 clock derived enable state.
 */
#define STM32_LPUART1_ENABLED               ((STM32_LPUART1_DEMANDED == TRUE))

/**
 * @brief   I2C1 clock derived enable state.
 */
#define STM32_I2C1_ENABLED                  ((STM32_I2C1_DEMANDED == TRUE))

/**
 * @brief   I2C2 clock derived enable state.
 */
#define STM32_I2C2_ENABLED                  ((STM32_I2C2_DEMANDED == TRUE))

/**
 * @brief   I2C4 clock derived enable state.
 */
#define STM32_I2C4_ENABLED                  ((STM32_I2C4_DEMANDED == TRUE))

/**
 * @brief   I2C5 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_I2C5_ENABLED                ((STM32_I2C5_DEMANDED == TRUE))
#else
  #define STM32_I2C5_ENABLED                FALSE
#endif

/**
 * @brief   I2C6 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_I2C6_ENABLED                ((STM32_I2C6_DEMANDED == TRUE))
#else
  #define STM32_I2C6_ENABLED                FALSE
#endif

/**
 * @brief   I2C3 clock derived enable state.
 */
#define STM32_I2C3_ENABLED                  ((STM32_I2C3_DEMANDED == TRUE))

/**
 * @brief   SPI1 clock derived enable state.
 */
#define STM32_SPI1_ENABLED                  ((STM32_SPI1_DEMANDED == TRUE))

/**
 * @brief   SPI2 clock derived enable state.
 */
#define STM32_SPI2_ENABLED                  ((STM32_SPI2_DEMANDED == TRUE))

/**
 * @brief   SPI3 clock derived enable state.
 */
#define STM32_SPI3_ENABLED                  ((STM32_SPI3_DEMANDED == TRUE))

/**
 * @brief   FDCAN1 clock derived enable state.
 */
#define STM32_FDCAN1_ENABLED                ((STM32_FDCAN1_DEMANDED == TRUE))

/**
 * @brief   HCLKDIV8 clock derived enable state.
 */
#define STM32_HCLKDIV8_ENABLED              (((STM32_SYSTICK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8)))

/**
 * @brief   SYSTICK clock derived enable state.
 */
#define STM32_SYSTICK_ENABLED               ((STM32_SYSTICK_DEMANDED == TRUE))

/**
 * @brief   TIM16IC clock derived enable state.
 */
#define STM32_TIM16IC_ENABLED               TRUE

/**
 * @brief   TIM17IC clock derived enable state.
 */
#define STM32_TIM17IC_ENABLED               TRUE

/**
 * @brief   LPTIM2IC clock derived enable state.
 */
#define STM32_LPTIM2IC_ENABLED              TRUE

/**
 * @brief   ICLK clock derived enable state.
 */
#define STM32_ICLK_ENABLED                  ((STM32_USB_ENABLED == TRUE) || \
                                             ((STM32_SDMMC_ENABLED == TRUE) && \
                                              (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)))

/**
 * @brief   USB clock derived enable state.
 */
#define STM32_USB_ENABLED                   ((STM32_USB_DEMANDED == TRUE))

/**
 * @brief   HSEDIV2 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_HSEDIV2_ENABLED             (((STM32_USBPHYC_ENABLED == TRUE) && \
                                              (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_HSEDIV2)))
#else
  #define STM32_HSEDIV2_ENABLED             FALSE
#endif

/**
 * @brief   PLL1PDIV2 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_PLL1PDIV2_ENABLED           (((STM32_USBPHYC_ENABLED == TRUE) && \
                                              (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2)))
#else
  #define STM32_PLL1PDIV2_ENABLED           FALSE
#endif

/**
 * @brief   USBPHYC clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_USBPHYC_ENABLED             ((STM32_OTGHS_DEMANDED == TRUE))
#else
  #define STM32_USBPHYC_ENABLED             FALSE
#endif

/**
 * @brief   SDMMC clock derived enable state.
 */
#define STM32_SDMMC_ENABLED                 ((STM32_SDMMC1_ENABLED == TRUE) || \
                                             (STM32_SDMMC2_ENABLED == TRUE))

/**
 * @brief   SDMMC1 clock derived enable state.
 */
#define STM32_SDMMC1_ENABLED                ((STM32_SDMMC1_DEMANDED == TRUE))

/**
 * @brief   SDMMC2 clock derived enable state.
 */
#define STM32_SDMMC2_ENABLED                ((STM32_SDMMC2_DEMANDED == TRUE))

/**
 * @brief   DSI clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_DSI_ENABLED                 ((STM32_DSI_DEMANDED == TRUE))
#else
  #define STM32_DSI_ENABLED                 FALSE
#endif

/**
 * @brief   LTDC clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_LTDC_ENABLED                ((STM32_LTDC_DEMANDED == TRUE))
#else
  #define STM32_LTDC_ENABLED                FALSE
#endif

/**
 * @brief   OCTOSPI clock derived enable state.
 */
#define STM32_OCTOSPI_ENABLED               ((STM32_OCTOSPI_DEMANDED == TRUE))

/**
 * @brief   HSPI1 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_HSPI1_ENABLED               ((STM32_HSPI1_DEMANDED == TRUE))
#else
  #define STM32_HSPI1_ENABLED               FALSE
#endif

/**
 * @brief   HSI48DIV2 clock derived enable state.
 */
#define STM32_HSI48DIV2_ENABLED             (((STM32_RNG_ENABLED == TRUE) && \
                                              (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)))

/**
 * @brief   SHSIDIV2 clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_SHSIDIV2_ENABLED            (((STM32_SAES_ENABLED == TRUE) && \
                                              (STM32_CFG_SAES_SEL == RCC_CCIPR2_SAESSEL_SHSIDIV2)))
#else
  #define STM32_SHSIDIV2_ENABLED            FALSE
#endif

/**
 * @brief   SAES clock derived enable state.
 */
#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_SAES_ENABLED                ((STM32_SAES_DEMANDED == TRUE))
#else
  #define STM32_SAES_ENABLED                FALSE
#endif

/**
 * @brief   RNG clock derived enable state.
 */
#define STM32_RNG_ENABLED                   ((STM32_RNG_DEMANDED == TRUE))

/**
 * @brief   SAI1 clock derived enable state.
 */
#define STM32_SAI1_ENABLED                  ((STM32_SAI1_DEMANDED == TRUE))

/**
 * @brief   SAI2 clock derived enable state.
 */
#define STM32_SAI2_ENABLED                  ((STM32_SAI2_DEMANDED == TRUE))

/**
 * @brief   MDF1 clock derived enable state.
 */
#define STM32_MDF1_ENABLED                  ((STM32_MDF1_DEMANDED == TRUE))

/**
 * @brief   ADF1 clock derived enable state.
 */
#define STM32_ADF1_ENABLED                  ((STM32_ADF1_DEMANDED == TRUE))

/**
 * @brief   ADCDAC clock derived enable state.
 */
#define STM32_ADCDAC_ENABLED                ((STM32_ADCDAC_DEMANDED == TRUE))

/**
 * @brief   DAC1SH clock derived enable state.
 */
#define STM32_DAC1SH_ENABLED                ((STM32_DAC1SH_DEMANDED == TRUE))

/**
 * @brief   LPTIM1 clock derived enable state.
 */
#define STM32_LPTIM1_ENABLED                ((STM32_LPTIM1_DEMANDED == TRUE))

/**
 * @brief   LPTIM2 clock derived enable state.
 */
#define STM32_LPTIM2_ENABLED                ((STM32_LPTIM2_DEMANDED == TRUE))

/**
 * @brief   LPTIM34 clock derived enable state.
 */
#define STM32_LPTIM34_ENABLED               ((STM32_LPTIM34_DEMANDED == TRUE))

/**
 * @brief   IWDG clock derived enable state.
 */
#define STM32_IWDG_ENABLED                  ((STM32_IWDG_DEMANDED == TRUE))

