emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the NONE clock point. -------------------------*/

/**
 * @brief   NONE nominal source frequency.
 */
#define STM32_NONE_SOURCE_FREQ              0U

/**
 * @brief   NONE clock register bits.
 */
#define STM32_NONE_BITS                     0U

/**
 * @brief   Pseudo-clock for disabled sources clock point.
 */
#define STM32_NONE_FREQ                     0U
#define STM32_NONE_CLOCK                    0U

/* --- Macros and checks for the AUDIOCLK clock point. ---------------------*/

/**
 * @brief   AUDIOCLK nominal source frequency.
 */
#define STM32_AUDIOCLK_SOURCE_FREQ          STM32_CFG_AUDIOCLK

/**
 * @brief   AUDIOCLK clock register bits.
 */
#define STM32_AUDIOCLK_BITS                 0U

/**
 * @brief   External audio clock point.
 */
#define STM32_AUDIOCLK_FREQ                 STM32_AUDIOCLK_SOURCE_FREQ
#define STM32_AUDIOCLK_CLOCK                STM32_AUDIOCLK_SOURCE_FREQ

/* --- Macros and checks for the DSIPHY clock point. -----------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   DSIPHY nominal source frequency.
 */
  #define STM32_DSIPHY_SOURCE_FREQ          STM32_CFG_DSIPHYCLK

/**
 * @brief   DSIPHY clock register bits.
 */
#define STM32_DSIPHY_BITS                   0U

/**
 * @brief   DSI PHY PLL output clock point.
 */
  #if (STM32_DSIPHY_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DSIPHY_FREQ               STM32_DSIPHY_SOURCE_FREQ
    #define STM32_DSIPHY_CLOCK              STM32_DSIPHY_SOURCE_FREQ
  #else
    #define STM32_DSIPHY_FREQ               0U
    #define STM32_DSIPHY_CLOCK              0U
  #endif
#else
  #define STM32_DSIPHY_SOURCE_FREQ          0U
  #define STM32_DSIPHY_BITS                 0U
  #define STM32_DSIPHY_FREQ                 0U
  #define STM32_DSIPHY_CLOCK                0U
#endif

/* --- Macros and checks for the HSI16 clock point. ------------------------*/

#if !((STM32_CFG_HSI16_ENABLE == TRUE) || (STM32_CFG_HSI16_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI16_ENABLE value specified"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) ||                                      \
     !((STM32_TIMICSEL_HSI16_SOURCE_DEMANDED == TRUE))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by TIMICSEL_HSI16_SOURCE"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL1IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL1IN"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL2IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL2IN"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL3IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL3IN"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&  \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SYSCLK"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&  \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by MCODIV"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART1_ENABLED == TRUE) &&  \
      (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART2_ENABLED == TRUE) &&  \
      (STM32_CFG_USART2_SEL == RCC_CCIPR1_USART2SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART3_ENABLED == TRUE) &&  \
      (STM32_CFG_USART3_SEL == RCC_CCIPR1_USART3SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART3"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART4_ENABLED == TRUE) &&   \
      (STM32_CFG_UART4_SEL == RCC_CCIPR1_UART4SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART4"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART5_ENABLED == TRUE) &&   \
      (STM32_CFG_UART5_SEL == RCC_CCIPR1_UART5SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART5"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART6_ENABLED == TRUE) &&  \
      (STM32_CFG_USART6_SEL == RCC_CCIPR2_USART6SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART6"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_HSI16))) &&           \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPUART1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C1_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C2_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C4_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C4"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C5_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C5_SEL == RCC_CCIPR2_I2C5SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C5"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C6_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C6_SEL == RCC_CCIPR2_I2C6SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C6"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C3_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C3"
#endif

