emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the USBPHYC clock point. ----------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   USBPHYC clock register bits.
 */
#if (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_HSE) || defined(__DOXYGEN__)
  #if (STM32_USBPHYC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USBPHYC_BITS              RCC_CCIPR2_USBPHYCSEL_HSE
  #else
    #define STM32_USBPHYC_BITS              0U
  #endif
#elif (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_PLL1P)
  #if (STM32_USBPHYC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USBPHYC_BITS              RCC_CCIPR2_USBPHYCSEL_PLL1P
  #else
    #define STM32_USBPHYC_BITS              0U
  #endif
#elif (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_HSEDIV2)
  #if (STM32_USBPHYC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USBPHYC_BITS              RCC_CCIPR2_USBPHYCSEL_HSEDIV2
  #else
    #define STM32_USBPHYC_BITS              0U
  #endif
#elif (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2)
  #if (STM32_USBPHYC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USBPHYC_BITS              RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2
  #else
    #define STM32_USBPHYC_BITS              0U
  #endif
#else
  #error "invalid STM32_CFG_USBPHYC_SEL value specified"
#endif

/**
 * @brief   OTG_HS PHY reference clock point.
 */
#if ((STM32_USBPHYC_ENABLED == TRUE) && \
     (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_HSE)) || \
    defined(__DOXYGEN__)
  #define STM32_USBPHYC_FREQ                STM32_HSE_FREQ
  #define STM32_USBPHYC_CLOCK               STM32_HSE_CLOCK
#elif (STM32_USBPHYC_ENABLED == TRUE) && \
      (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_PLL1P)
  #define STM32_USBPHYC_FREQ                STM32_PLL1P_FREQ
  #define STM32_USBPHYC_CLOCK               STM32_PLL1P_CLOCK
#elif (STM32_USBPHYC_ENABLED == TRUE) && \
      (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_HSEDIV2)
  #define STM32_USBPHYC_FREQ                STM32_HSEDIV2_FREQ
  #define STM32_USBPHYC_CLOCK               STM32_HSEDIV2_CLOCK
#elif (STM32_USBPHYC_ENABLED == TRUE) && \
      (STM32_CFG_USBPHYC_SEL == RCC_CCIPR2_USBPHYCSEL_PLL1PDIV2)
  #define STM32_USBPHYC_FREQ                STM32_PLL1PDIV2_FREQ
  #define STM32_USBPHYC_CLOCK               STM32_PLL1PDIV2_CLOCK
#else
  #define STM32_USBPHYC_FREQ                0U
  #define STM32_USBPHYC_CLOCK               0U
#endif
#else
  #define STM32_USBPHYC_BITS                0U
  #define STM32_USBPHYC_FREQ                0U
  #define STM32_USBPHYC_CLOCK               0U
#endif

/* --- Macros and checks for the SDMMC clock point. ------------------------*/

/**
 * @brief   SDMMC clock register bits.
 */
#if (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK) || defined(__DOXYGEN__)
  #if (STM32_SDMMC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SDMMC_BITS                RCC_CCIPR2_SDMMCSEL_ICLK
  #else
    #define STM32_SDMMC_BITS                0U
  #endif
#elif (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)
  #if (STM32_SDMMC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SDMMC_BITS                RCC_CCIPR2_SDMMCSEL_PLL1P
  #else
    #define STM32_SDMMC_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_SDMMC_SEL value specified"
#endif

/**
 * @brief   SDMMC clock point.
 */
#if ((STM32_SDMMC_ENABLED == TRUE) && \
     (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)) || \
    defined(__DOXYGEN__)
  #define STM32_SDMMC_FREQ                  STM32_ICLK_FREQ
  #define STM32_SDMMC_CLOCK                 STM32_ICLK_CLOCK
#elif (STM32_SDMMC_ENABLED == TRUE) && \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)
  #define STM32_SDMMC_FREQ                  STM32_PLL1P_FREQ
  #define STM32_SDMMC_CLOCK                 STM32_PLL1P_CLOCK
#else
  #define STM32_SDMMC_FREQ                  0U
  #define STM32_SDMMC_CLOCK                 0U
#endif

#if !(!((STM32_SDMMC_ENABLED == TRUE) &&                                    \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)) ||                 \
     (STM32_ICLK_FREQ <= STM32_SDMMCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SDMMC_FREQ above maximum frequency"
#endif

#if !(!((STM32_SDMMC_ENABLED == TRUE) &&                                    \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)) ||                \
     (STM32_PLL1P_FREQ <= STM32_SDMMCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SDMMC_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the SDMMC1 clock point. -----------------------*/

/**
 * @brief   SDMMC1 clock register bits.
 */
#define STM32_SDMMC1_BITS                   0U

/**
 * @brief   SDMMC1 clock point.
 */
#if (STM32_SDMMC1_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SDMMC1_FREQ                 STM32_SDMMC_FREQ
  #define STM32_SDMMC1_CLOCK                STM32_SDMMC_CLOCK
#else
  #define STM32_SDMMC1_FREQ                 0U
  #define STM32_SDMMC1_CLOCK                0U
#endif

/* --- Macros and checks for the SDMMC2 clock point. -----------------------*/

/**
 * @brief   SDMMC2 clock register bits.
 */
#define STM32_SDMMC2_BITS                   0U

/**
 * @brief   SDMMC2 clock point.
 */
#if (STM32_SDMMC2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SDMMC2_FREQ                 STM32_SDMMC_FREQ
  #define STM32_SDMMC2_CLOCK                STM32_SDMMC_CLOCK
#else
  #define STM32_SDMMC2_FREQ                 0U
  #define STM32_SDMMC2_CLOCK                0U
#endif

/* --- Macros and checks for the DSI clock point. --------------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   DSI clock register bits.
 */
#if (STM32_CFG_DSI_SEL == RCC_CCIPR2_DSIHOSTSEL_PLL3P) || defined(__DOXYGEN__)
  #if (STM32_DSI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DSI_BITS                  RCC_CCIPR2_DSIHOSTSEL_PLL3P
  #else
    #define STM32_DSI_BITS                  0U
  #endif
#elif (STM32_CFG_DSI_SEL == RCC_CCIPR2_DSIHOSTSEL_DSIPHY)
  #if (STM32_DSI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DSI_BITS                  RCC_CCIPR2_DSIHOSTSEL_DSIPHY
  #else
    #define STM32_DSI_BITS                  0U
  #endif
#else
  #error "invalid STM32_CFG_DSI_SEL value specified"
#endif

/**
 * @brief   DSI kernel clock point.
 */
#if ((STM32_DSI_ENABLED == TRUE) && \
     (STM32_CFG_DSI_SEL == RCC_CCIPR2_DSIHOSTSEL_PLL3P)) || \
    defined(__DOXYGEN__)
  #define STM32_DSI_FREQ                    STM32_PLL3P_FREQ
  #define STM32_DSI_CLOCK                   STM32_PLL3P_CLOCK
#elif (STM32_DSI_ENABLED == TRUE) && \
      (STM32_CFG_DSI_SEL == RCC_CCIPR2_DSIHOSTSEL_DSIPHY)
  #define STM32_DSI_FREQ                    STM32_DSIPHY_FREQ
  #define STM32_DSI_CLOCK                   STM32_DSIPHY_CLOCK
#else
  #define STM32_DSI_FREQ                    0U
  #define STM32_DSI_CLOCK                   0U
#endif
#else
  #define STM32_DSI_BITS                    0U
  #define STM32_DSI_FREQ                    0U
  #define STM32_DSI_CLOCK                   0U
#endif

/* --- Macros and checks for the LTDC clock point. -------------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   LTDC clock register bits.
 */
#if (STM32_CFG_LTDC_SEL == RCC_CCIPR2_LTDCSEL_PLL3R) || defined(__DOXYGEN__)
  #if (STM32_LTDC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LTDC_BITS                 RCC_CCIPR2_LTDCSEL_PLL3R
  #else
    #define STM32_LTDC_BITS                 0U
  #endif
#elif (STM32_CFG_LTDC_SEL == RCC_CCIPR2_LTDCSEL_PLL2R)
  #if (STM32_LTDC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LTDC_BITS                 RCC_CCIPR2_LTDCSEL_PLL2R
  #else
    #define STM32_LTDC_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_LTDC_SEL value specified"
#endif

/**
 * @brief   LTDC kernel clock point.
 */
#if ((STM32_LTDC_ENABLED == TRUE) && \
     (STM32_CFG_LTDC_SEL == RCC_CCIPR2_LTDCSEL_PLL3R)) || \
    defined(__DOXYGEN__)
  #define STM32_LTDC_FREQ                   STM32_PLL3R_FREQ
  #define STM32_LTDC_CLOCK                  STM32_PLL3R_CLOCK
#elif (STM32_LTDC_ENABLED == TRUE) && \
      (STM32_CFG_LTDC_SEL == RCC_CCIPR2_LTDCSEL_PLL2R)
  #define STM32_LTDC_FREQ                   STM32_PLL2R_FREQ
  #define STM32_LTDC_CLOCK                  STM32_PLL2R_CLOCK
#else
  #define STM32_LTDC_FREQ                   0U
  #define STM32_LTDC_CLOCK                  0U
#endif
#else
  #define STM32_LTDC_BITS                   0U
  #define STM32_LTDC_FREQ                   0U
  #define STM32_LTDC_CLOCK                  0U
#endif

