emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the OCTOSPI clock point. ----------------------*/

/**
 * @brief   OCTOSPI clock register bits.
 */
#if (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK) ||              \
    defined(__DOXYGEN__)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_SYSCLK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_MSIK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL1Q)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_PLL1Q
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL2Q)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_PLL2Q
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_OCTOSPI_ENABLED == FALSE) &&                                   \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_IGNORE)
  #define STM32_OCTOSPI_BITS                0U
#else
  #error "invalid STM32_CFG_OCTOSPI_SEL value specified"
#endif

/**
 * @brief   OCTOSPI clock point.
 */
#if ((STM32_OCTOSPI_ENABLED == TRUE) && \
     (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_OCTOSPI_FREQ                STM32_SYSCLK_FREQ
  #define STM32_OCTOSPI_CLOCK               STM32_SYSCLK_CLOCK
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #define STM32_OCTOSPI_FREQ                STM32_MSIK_FREQ
  #define STM32_OCTOSPI_CLOCK               STM32_MSIK_CLOCK
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL1Q)
  #define STM32_OCTOSPI_FREQ                STM32_PLL1Q_FREQ
  #define STM32_OCTOSPI_CLOCK               STM32_PLL1Q_CLOCK
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL2Q)
  #define STM32_OCTOSPI_FREQ                STM32_PLL2Q_FREQ
  #define STM32_OCTOSPI_CLOCK               STM32_PLL2Q_CLOCK
#else
  #define STM32_OCTOSPI_FREQ                0U
  #define STM32_OCTOSPI_CLOCK               0U
#endif

/* --- Macros and checks for the HSPI1 clock point. ------------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U599 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   HSPI1 clock register bits.
 */
#if (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_SYSCLK) || defined(__DOXYGEN__)
  #if (STM32_HSPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HSPI1_BITS                RCC_CCIPR2_HSPISEL_SYSCLK
  #else
    #define STM32_HSPI1_BITS                0U
  #endif
#elif (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL1Q)
  #if (STM32_HSPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HSPI1_BITS                RCC_CCIPR2_HSPISEL_PLL1Q
  #else
    #define STM32_HSPI1_BITS                0U
  #endif
#elif (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL2Q)
  #if (STM32_HSPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HSPI1_BITS                RCC_CCIPR2_HSPISEL_PLL2Q
  #else
    #define STM32_HSPI1_BITS                0U
  #endif
#elif (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL3R)
  #if (STM32_HSPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HSPI1_BITS                RCC_CCIPR2_HSPISEL_PLL3R
  #else
    #define STM32_HSPI1_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_HSPI1_SEL value specified"
#endif

/**
 * @brief   HSPI1 kernel clock point.
 */
#if ((STM32_HSPI1_ENABLED == TRUE) && \
     (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_HSPI1_FREQ                  STM32_SYSCLK_FREQ
  #define STM32_HSPI1_CLOCK                 STM32_SYSCLK_CLOCK
#elif (STM32_HSPI1_ENABLED == TRUE) && \
      (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL1Q)
  #define STM32_HSPI1_FREQ                  STM32_PLL1Q_FREQ
  #define STM32_HSPI1_CLOCK                 STM32_PLL1Q_CLOCK
#elif (STM32_HSPI1_ENABLED == TRUE) && \
      (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL2Q)
  #define STM32_HSPI1_FREQ                  STM32_PLL2Q_FREQ
  #define STM32_HSPI1_CLOCK                 STM32_PLL2Q_CLOCK
#elif (STM32_HSPI1_ENABLED == TRUE) && \
      (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL3R)
  #define STM32_HSPI1_FREQ                  STM32_PLL3R_FREQ
  #define STM32_HSPI1_CLOCK                 STM32_PLL3R_CLOCK
#else
  #define STM32_HSPI1_FREQ                  0U
  #define STM32_HSPI1_CLOCK                 0U
#endif

  #if !(!((STM32_HSPI1_ENABLED == TRUE) &&                                  \
        (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_SYSCLK)) ||              \
       (STM32_SYSCLK_FREQ <= STM32_HSPICLK_MAX)) && !defined(__DOXYGEN__)
    #error "STM32_HSPI1_FREQ above maximum frequency"
  #endif

  #if !(!((STM32_HSPI1_ENABLED == TRUE) &&                                  \
        (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL1Q)) ||               \
       (STM32_PLL1Q_FREQ <= STM32_HSPICLK_MAX)) && !defined(__DOXYGEN__)
    #error "STM32_HSPI1_FREQ above maximum frequency"
  #endif

  #if !(!((STM32_HSPI1_ENABLED == TRUE) &&                                  \
        (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL2Q)) ||               \
       (STM32_PLL2Q_FREQ <= STM32_HSPICLK_MAX)) && !defined(__DOXYGEN__)
    #error "STM32_HSPI1_FREQ above maximum frequency"
  #endif

