emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
  #if !(!((STM32_HSPI1_ENABLED == TRUE) &&                                  \
        (STM32_CFG_HSPI1_SEL == RCC_CCIPR2_HSPISEL_PLL3R)) ||               \
       (STM32_PLL3R_FREQ <= STM32_HSPICLK_MAX)) && !defined(__DOXYGEN__)
    #error "STM32_HSPI1_FREQ above maximum frequency"
  #endif
#else
  #define STM32_HSPI1_BITS                  0U
  #define STM32_HSPI1_FREQ                  0U
  #define STM32_HSPI1_CLOCK                 0U
#endif

/* --- Macros and checks for the HSI48DIV2 clock point. --------------------*/

/**
 * @brief   HSI48DIV2 clock register bits.
 */
#define STM32_HSI48DIV2_BITS                0U

/**
 * @brief   HSI48 divided by 2 clock point.
 */
#if (STM32_HSI48DIV2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48DIV2_FREQ              (STM32_HSI48_FREQ / 2U)
  #define STM32_HSI48DIV2_CLOCK             (STM32_HSI48_CLOCK / 2U)
#else
  #define STM32_HSI48DIV2_FREQ              0U
  #define STM32_HSI48DIV2_CLOCK             0U
#endif

/* --- Macros and checks for the SHSIDIV2 clock point. ---------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   SHSIDIV2 clock register bits.
 */
#define STM32_SHSIDIV2_BITS                 0U

/**
 * @brief   SHSI divided-by-two clock point.
 */
  #if (STM32_SHSIDIV2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SHSIDIV2_FREQ             (STM32_SHSI_FREQ / 2U)
    #define STM32_SHSIDIV2_CLOCK            (STM32_SHSI_CLOCK / 2U)
  #else
    #define STM32_SHSIDIV2_FREQ             0U
    #define STM32_SHSIDIV2_CLOCK            0U
  #endif
#else
  #define STM32_SHSIDIV2_BITS               0U
  #define STM32_SHSIDIV2_FREQ               0U
  #define STM32_SHSIDIV2_CLOCK              0U
#endif

/* --- Macros and checks for the SAES clock point. -------------------------*/

#if ((STM32_CLOCKTREE_VARIANT_U585 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE) ||                              \
     (STM32_CLOCKTREE_VARIANT_U5A9 == TRUE)) || defined(__DOXYGEN__)
/**
 * @brief   SAES clock register bits.
 */
#if (STM32_CFG_SAES_SEL == RCC_CCIPR2_SAESSEL_SHSI) || defined(__DOXYGEN__)
  #if (STM32_SAES_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAES_BITS                 RCC_CCIPR2_SAESSEL_SHSI
  #else
    #define STM32_SAES_BITS                 0U
  #endif
#elif (STM32_CFG_SAES_SEL == RCC_CCIPR2_SAESSEL_SHSIDIV2)
  #if (STM32_SAES_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAES_BITS                 RCC_CCIPR2_SAESSEL_SHSIDIV2
  #else
    #define STM32_SAES_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SAES_SEL value specified"
#endif

/**
 * @brief   SAES kernel clock point.
 */
#if ((STM32_SAES_ENABLED == TRUE) && \
     (STM32_CFG_SAES_SEL == RCC_CCIPR2_SAESSEL_SHSI)) || \
    defined(__DOXYGEN__)
  #define STM32_SAES_FREQ                   STM32_SHSI_FREQ
  #define STM32_SAES_CLOCK                  STM32_SHSI_CLOCK
#elif (STM32_SAES_ENABLED == TRUE) && \
      (STM32_CFG_SAES_SEL == RCC_CCIPR2_SAESSEL_SHSIDIV2)
  #define STM32_SAES_FREQ                   STM32_SHSIDIV2_FREQ
  #define STM32_SAES_CLOCK                  STM32_SHSIDIV2_CLOCK
#else
  #define STM32_SAES_FREQ                   0U
  #define STM32_SAES_CLOCK                  0U
#endif
#else
  #define STM32_SAES_BITS                   0U
  #define STM32_SAES_FREQ                   0U
  #define STM32_SAES_CLOCK                  0U
#endif

/* --- Macros and checks for the RNG clock point. --------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#if (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI48
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI48DIV2
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI16
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_RNG_ENABLED == FALSE) &&                                       \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_IGNORE)
  #define STM32_RNG_BITS                    0U
#else
  #error "invalid STM32_CFG_RNG_SEL value specified"
#endif

/**
 * @brief   RNG clock point.
 */
#if ((STM32_RNG_ENABLED == TRUE) && \
     (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_RNG_FREQ                    STM32_HSI48_FREQ
  #define STM32_RNG_CLOCK                   STM32_HSI48_CLOCK
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)
  #define STM32_RNG_FREQ                    STM32_HSI48DIV2_FREQ
  #define STM32_RNG_CLOCK                   STM32_HSI48DIV2_CLOCK
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16)
  #define STM32_RNG_FREQ                    STM32_HSI16_FREQ
  #define STM32_RNG_CLOCK                   STM32_HSI16_CLOCK
#else
  #define STM32_RNG_FREQ                    0U
  #define STM32_RNG_CLOCK                   0U
#endif

/* --- Macros and checks for the SAI1 clock point. -------------------------*/

/**
 * @brief   SAI1 clock register bits.
 */
#if (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL2P) || defined(__DOXYGEN__)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL2P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL3P)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL3P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL1P)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL1P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_AUDIOCLK
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_HSI16
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_SAI1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_IGNORE)
  #define STM32_SAI1_BITS                   0U
#else
  #error "invalid STM32_CFG_SAI1_SEL value specified"
#endif

/**
 * @brief   SAI1 clock point.
 */
#if ((STM32_SAI1_ENABLED == TRUE) && \
     (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL2P)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI1_FREQ                   STM32_PLL2P_FREQ
  #define STM32_SAI1_CLOCK                  STM32_PLL2P_CLOCK
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL3P)
  #define STM32_SAI1_FREQ                   STM32_PLL3P_FREQ
  #define STM32_SAI1_CLOCK                  STM32_PLL3P_CLOCK
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL1P)
  #define STM32_SAI1_FREQ                   STM32_PLL1P_FREQ
  #define STM32_SAI1_CLOCK                  STM32_PLL1P_CLOCK
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #define STM32_SAI1_FREQ                   STM32_AUDIOCLK_FREQ
  #define STM32_SAI1_CLOCK                  STM32_AUDIOCLK_CLOCK
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16)
  #define STM32_SAI1_FREQ                   STM32_HSI16_FREQ
  #define STM32_SAI1_CLOCK                  STM32_HSI16_CLOCK
#else
  #define STM32_SAI1_FREQ                   0U
  #define STM32_SAI1_CLOCK                  0U
#endif

/* --- Macros and checks for the SAI2 clock point. -------------------------*/

/**
 * @brief   SAI2 clock register bits.
 */
#if (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL2P) || defined(__DOXYGEN__)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL2P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL3P)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL3P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL1P)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL1P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_AUDIOCLK)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_AUDIOCLK
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_HSI16
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_SAI2_ENABLED == FALSE) &&                                      \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_IGNORE)
  #define STM32_SAI2_BITS                   0U
#else
  #error "invalid STM32_CFG_SAI2_SEL value specified"
#endif

/**
 * @brief   SAI2 clock point.
 */
#if ((STM32_SAI2_ENABLED == TRUE) && \
     (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL2P)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI2_FREQ                   STM32_PLL2P_FREQ
  #define STM32_SAI2_CLOCK                  STM32_PLL2P_CLOCK
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL3P)
  #define STM32_SAI2_FREQ                   STM32_PLL3P_FREQ
  #define STM32_SAI2_CLOCK                  STM32_PLL3P_CLOCK
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL1P)
  #define STM32_SAI2_FREQ                   STM32_PLL1P_FREQ
  #define STM32_SAI2_CLOCK                  STM32_PLL1P_CLOCK
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_AUDIOCLK)
  #define STM32_SAI2_FREQ                   STM32_AUDIOCLK_FREQ
  #define STM32_SAI2_CLOCK                  STM32_AUDIOCLK_CLOCK
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16)
  #define STM32_SAI2_FREQ                   STM32_HSI16_FREQ
  #define STM32_SAI2_CLOCK                  STM32_HSI16_CLOCK
#else
  #define STM32_SAI2_FREQ                   0U
  #define STM32_SAI2_CLOCK                  0U
#endif

