emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the MDF1 clock point. -------------------------*/

/**
 * @brief   MDF1 clock register bits.
 */
#if (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_HCLK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL1P)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_PLL1P
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL3Q)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_PLL3Q
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_AUDIOCLK)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_AUDIOCLK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_MSIK)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_MSIK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_MDF1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_IGNORE)
  #define STM32_MDF1_BITS                   0U
#else
  #error "invalid STM32_CFG_MDF1_SEL value specified"
#endif

/**
 * @brief   MDF1 clock point.
 */
#if ((STM32_MDF1_ENABLED == TRUE) && \
     (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_MDF1_FREQ                   STM32_HCLK_FREQ
  #define STM32_MDF1_CLOCK                  STM32_HCLK_CLOCK
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL1P)
  #define STM32_MDF1_FREQ                   STM32_PLL1P_FREQ
  #define STM32_MDF1_CLOCK                  STM32_PLL1P_CLOCK
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL3Q)
  #define STM32_MDF1_FREQ                   STM32_PLL3Q_FREQ
  #define STM32_MDF1_CLOCK                  STM32_PLL3Q_CLOCK
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_AUDIOCLK)
  #define STM32_MDF1_FREQ                   STM32_AUDIOCLK_FREQ
  #define STM32_MDF1_CLOCK                  STM32_AUDIOCLK_CLOCK
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_MSIK)
  #define STM32_MDF1_FREQ                   STM32_MSIK_FREQ
  #define STM32_MDF1_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_MDF1_FREQ                   0U
  #define STM32_MDF1_CLOCK                  0U
#endif

/* --- Macros and checks for the ADF1 clock point. -------------------------*/

/**
 * @brief   ADF1 clock register bits.
 */
#if (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_HCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL1P)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_PLL1P
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL3Q)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_PLL3Q
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_AUDIOCLK)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_AUDIOCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_MSIK)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_MSIK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_ADF1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_IGNORE)
  #define STM32_ADF1_BITS                   0U
#else
  #error "invalid STM32_CFG_ADF1_SEL value specified"
#endif

/**
 * @brief   ADF1 clock point.
 */
#if ((STM32_ADF1_ENABLED == TRUE) && \
     (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADF1_FREQ                   STM32_HCLK_FREQ
  #define STM32_ADF1_CLOCK                  STM32_HCLK_CLOCK
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL1P)
  #define STM32_ADF1_FREQ                   STM32_PLL1P_FREQ
  #define STM32_ADF1_CLOCK                  STM32_PLL1P_CLOCK
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL3Q)
  #define STM32_ADF1_FREQ                   STM32_PLL3Q_FREQ
  #define STM32_ADF1_CLOCK                  STM32_PLL3Q_CLOCK
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_AUDIOCLK)
  #define STM32_ADF1_FREQ                   STM32_AUDIOCLK_FREQ
  #define STM32_ADF1_CLOCK                  STM32_AUDIOCLK_CLOCK
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_MSIK)
  #define STM32_ADF1_FREQ                   STM32_MSIK_FREQ
  #define STM32_ADF1_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_ADF1_FREQ                   0U
  #define STM32_ADF1_CLOCK                  0U
#endif

/* --- Macros and checks for the ADCDAC clock point. -----------------------*/

/**
 * @brief   ADCDAC clock register bits.
 */
#if (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HCLK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_SYSCLK)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_SYSCLK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_PLL2R
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HSE
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HSI16
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_MSIK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_ADCDAC_ENABLED == FALSE) &&                                    \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_IGNORE)
  #define STM32_ADCDAC_BITS                 0U
#else
  #error "invalid STM32_CFG_ADCDAC_SEL value specified"
#endif

/**
 * @brief   ADC and DAC clock point.
 */
#if ((STM32_ADCDAC_ENABLED == TRUE) && \
     (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADCDAC_FREQ                 STM32_HCLK_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_HCLK_CLOCK
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_SYSCLK)
  #define STM32_ADCDAC_FREQ                 STM32_SYSCLK_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_SYSCLK_CLOCK
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)
  #define STM32_ADCDAC_FREQ                 STM32_PLL2R_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_PLL2R_CLOCK
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE)
  #define STM32_ADCDAC_FREQ                 STM32_HSE_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_HSE_CLOCK
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16)
  #define STM32_ADCDAC_FREQ                 STM32_HSI16_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)
  #define STM32_ADCDAC_FREQ                 STM32_MSIK_FREQ
  #define STM32_ADCDAC_CLOCK                STM32_MSIK_CLOCK
#else
  #define STM32_ADCDAC_FREQ                 0U
  #define STM32_ADCDAC_CLOCK                0U
#endif

/* --- Macros and checks for the DAC1SH clock point. -----------------------*/

/**
 * @brief   DAC1SH clock register bits.
 */
#if (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSE) || defined(__DOXYGEN__)
  #if (STM32_DAC1SH_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DAC1SH_BITS               RCC_CCIPR3_DAC1SEL_LSE
  #else
    #define STM32_DAC1SH_BITS               0U
  #endif
#elif (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSI)
  #if (STM32_DAC1SH_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DAC1SH_BITS               RCC_CCIPR3_DAC1SEL_LSI
  #else
    #define STM32_DAC1SH_BITS               0U
  #endif
#elif (STM32_DAC1SH_ENABLED == FALSE) &&                                    \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_IGNORE)
  #define STM32_DAC1SH_BITS                 0U
#else
  #error "invalid STM32_CFG_DAC1SH_SEL value specified"
#endif

/**
 * @brief   DAC1 sample and hold clock point.
 */
#if ((STM32_DAC1SH_ENABLED == TRUE) && \
     (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSE)) || \
    defined(__DOXYGEN__)
  #define STM32_DAC1SH_FREQ                 STM32_LSESYS_FREQ
  #define STM32_DAC1SH_CLOCK                STM32_LSESYS_CLOCK
#elif (STM32_DAC1SH_ENABLED == TRUE) && \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSI)
  #define STM32_DAC1SH_FREQ                 STM32_LSI_FREQ
  #define STM32_DAC1SH_CLOCK                STM32_LSI_CLOCK
#else
  #define STM32_DAC1SH_FREQ                 0U
  #define STM32_DAC1SH_CLOCK                0U
#endif

